In [3]:
import pandas as pd

#Load data from csv file
data=pd.read_csv("C:\\Users\\acorn-508\\python\\sampledata\\10_phone_data.csv", parse_dates=True)
#parse_dates=True ==>날짜, 시간관련있는 데이터를 문자열이 아니라 날짜시간 데이터유형으로 불러오기
data.head()

   index            date  duration  item    month   network network_type
0      0  15/10/14 06:58    34.429  data  2014-11      data         data
1      1  15/10/14 06:58    13.000  call  2014-11  Vodafone       mobile
2      2  15/10/14 14:46    23.000  call  2014-11    Meteor       mobile
3      3  15/10/14 14:48     4.000  call  2014-11     Tesco       mobile
4      4  15/10/14 17:27     4.000  call  2014-11     Tesco       mobile

In [4]:
import dateutil#(data타입으로 만들기 위한 패키지)

In [6]:
data=pd.read_csv("C:\\Users\\acorn-508\\python\\sampledata\\10_phone_data.csv")
data["date"]=data["date"].apply(dateutil.parser.parse, dayfirst=True)
data.head()

   index                date  duration  item    month   network network_type
0      0 2014-10-15 06:58:00    34.429  data  2014-11      data         data
1      1 2014-10-15 06:58:00    13.000  call  2014-11  Vodafone       mobile
2      2 2014-10-15 14:46:00    23.000  call  2014-11    Meteor       mobile
3      3 2014-10-15 14:48:00     4.000  call  2014-11     Tesco       mobile
4      4 2014-10-15 17:27:00     4.000  call  2014-11     Tesco       mobile

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 830 entries, 0 to 829
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   index         830 non-null    int64
 1   date          830 non-null    datetime64[ns]
 2   duration      830 non-null    float64
 3   item          830 non-null    object
 4   month         830 non-null    object
 5   network       830 non-null    object
 6   network_type  830 non-null    object
dtypes: datetime64[ns](1), float64(1), int64(1), object(4)
memory usage: 45.5+ KB

In [9]:
data["item"].value_counts()

call    388
sms     292
data    150
Name: item, dtype: int64

Q1. 전체 데이터 중에서 item의 data의 수가 몇개인가요?           
Q2. 전체 데이터 중에서 duration의 값을 참조하여 가장 긴 사용시간을 찾아보세요            
Q3. 전체 데이터 중에서 통화(item에서 call)인 값들의 사용시간(duration)의 합을 찾아보세요 =>boolean인덱싱         
Q4. 전체 데이터 중에서 각 달에 얼마나 많은 건수가 있는지 확인해보세요

In [10]:
data.head()

   index                date  duration  item    month   network network_type
0      0 2014-10-15 06:58:00    34.429  data  2014-11      data         data
1      1 2014-10-15 06:58:00    13.000  call  2014-11  Vodafone       mobile
2      2 2014-10-15 14:46:00    23.000  call  2014-11    Meteor       mobile
3      3 2014-10-15 14:48:00     4.000  call  2014-11     Tesco       mobile
4      4 2014-10-15 17:27:00     4.000  call  2014-11     Tesco       mobile

In [22]:
data["item"].value_counts()["data"]

150

In [23]:
data["item"].value_counts()[2]

150

In [24]:
data["item"].count()

830

In [20]:
data["duration"].max()

10528.0

In [30]:
data["duration"][data["item"]=="call"].sum()

92321.0

In [35]:
data["month"].value_counts()

2014-11    230
2015-01    205
2014-12    157
2015-02    137
2015-03    101
Name: month, dtype: int64

In [37]:
for i in data["month"].unique():
    print(data[data["month"]==i])

     index                date  duration  item    month   network network_type
0        0 2014-10-15 06:58:00    34.429  data  2014-11      data         data
1        1 2014-10-15 06:58:00    13.000  call  2014-11  Vodafone       mobile
2        2 2014-10-15 14:46:00    23.000  call  2014-11    Meteor       mobile
3        3 2014-10-15 14:48:00     4.000  call  2014-11     Tesco       mobile
4        4 2014-10-15 17:27:00     4.000  call  2014-11     Tesco       mobile
..     ...                 ...       ...   ...      ...       ...          ...
225    225 2014-11-12 19:18:00     1.000   sms  2014-11     Three       mobile
226    226 2014-11-12 19:18:00     1.000   sms  2014-11     Three       mobile
227    227 2014-11-12 19:20:00     1.000   sms  2014-11  Vodafone       mobile
229    229 2014-11-13 22:30:00     1.000   sms  2014-11     Three       mobile
230    230 2014-11-13 22:31:00     1.000   sms  2014-11  Vodafone       mobile

[230 rows x 7 columns]
     index                date  duration  item    month    network  \
228    228 2014-11-13 06:58:00    34.429  data  2014-12       data
231    231 2014-11-14 06:58:00    34.429  data  2014-12       data
232    232 2014-11-14 17:24:00   124.000  call  2014-12  voicemail
233    233 2014-11-14 17:28:00     1.000   sms  2014-12   Vodafone
234    234 2014-11-15 06:58:00    34.429  data  2014-12       data
..     ...                 ...       ...   ...      ...        ...
383    383 2014-12-14 02:05:00    14.000  call  2014-12   landline
384    384 2014-12-14 02:07:00     8.000  call  2014-12   landline
385    385 2014-12-14 02:09:00    74.000  call  2014-12   landline
387    387 2014-12-14 15:28:00    59.000  call  2014-12  voicemail
388    388 2014-12-14 19:54:00    25.000  call  2014-12      Three

    network_type
228         data
231         data
232    voicemail
233       mobile
234         data
..           ...
383     landline
384     landline
385     landline
387    voicemail
388       mobile

[157 rows x 7 columns]
     index                date  duration  item    month   network network_type
381    381 2014-12-13 06:58:00    34.429  data  2015-01      data         data
386    386 2014-12-14 06:58:00    34.429  data  2015-01      data         data
389    389 2014-12-15 06:58:00    34.429  data  2015-01      data         data
390    390 2014-12-15 19:56:00     1.000   sms  2015-01     Three       mobile
391    391 2014-12-15 19:58:00     1.000   sms  2015-01     Three       mobile
..     ...                 ...       ...   ...      ...       ...          ...
589    589 2015-01-14 20:47:00    36.000  call  2015-01     Three       mobile
590    590 2015-01-14 23:34:00     1.000   sms  2015-01  Vodafone       mobile
591    591 2015-01-14 23:34:00     1.000   sms  2015-01  Vodafone       mobile
592    592 2015-01-14 23:35:00     1.000   sms  2015-01     Three       mobile
593    593 2015-01-14 23:36:00     1.000   sms  2015-01     Three       mobile

[205 rows x 7 columns]
     index                date  duration  item    month   network network_type
577    577 2015-01-13 06:58:00    34.429  data  2015-02      data         data
586    586 2015-01-14 06:58:00    34.429  data  2015-02      data         data
594    594 2015-01-15 06:58:00    34.429  data  2015-02      data         data
595    595 2015-01-15 10:36:00    28.000  call  2015-02     Three       mobile
596    596 2015-01-15 12:23:00     1.000   sms  2015-02   special      special
..     ...                 ...       ...   ...      ...       ...          ...
724    724 2015-02-10 00:24:00     1.000   sms  2015-02  Vodafone       mobile
725    725 2015-02-10 06:58:00    34.429  data  2015-02      data         data
726    726 2015-02-10 21:40:00     1.000   sms  2015-02  Vodafone       mobile
727    727 2015-02-11 06:58:00    34.429  data  2015-02      data         data
728    728 2015-02-12 06:58:00    34.429  data  2015-02      data         data

[137 rows x 7 columns]
     index                date  duration  item    month   network network_type
729    729 2015-02-12 20:15:00    69.000  call  2015-03  landline     landline
730    730 2015-02-12 20:51:00    86.000  call  2015-03     Tesco       mobile
731    731 2015-02-13 06:58:00    34.429  data  2015-03      data         data
732    732 2015-02-13 10:58:00   451.000  call  2015-03  Vodafone       mobile
733    733 2015-02-13 21:13:00     8.000  call  2015-03  Vodafone       mobile
..     ...                 ...       ...   ...      ...       ...          ...
825    825 2015-03-13 00:38:00     1.000   sms  2015-03     world        world
826    826 2015-03-13 00:39:00     1.000   sms  2015-03  Vodafone       mobile
827    827 2015-03-13 06:58:00    34.429  data  2015-03      data         data
828    828 2015-03-14 00:13:00     1.000   sms  2015-03     world        world
829    829 2015-03-14 00:16:00     1.000   sms  2015-03     world        world

[101 rows x 7 columns]

In [38]:
data.groupby(["month"])

In [39]:
data.groupby(["month"]).groups.keys()

dict_keys(['2014-11', '2014-12', '2015-01', '2015-02', '2015-03'])

In [41]:
data.groupby(["month"]).groups.values()

dict_values([Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            220, 221, 222, 223, 224, 225, 226, 227, 229, 230],
           dtype='int64', length=230), Int64Index([228, 231, 232, 233, 234, 235, 236, 237, 238, 239,
            ...
            377, 378, 379, 380, 382, 383, 384, 385, 387, 388],
           dtype='int64', length=157), Int64Index([381, 386, 389, 390, 391, 392, 393, 394, 395, 396,
            ...
            583, 584, 585, 587, 588, 589, 590, 591, 592, 593],
           dtype='int64', length=205), Int64Index([577, 586, 594, 595, 596, 597, 598, 599, 600, 601,
            ...
            719, 720, 721, 722, 723, 724, 725, 726, 727, 728],
           dtype='int64', length=137), Int64Index([729, 730, 731, 732, 733, 734, 735, 736, 737, 738,
            ...
            820, 821, 822, 823, 824, 825, 826, 827, 828, 829],
           dtype='int64', length=101)])

In [42]:
data.groupby(["month"]).groups["2014-11"]

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            220, 221, 222, 223, 224, 225, 226, 227, 229, 230],
           dtype='int64', length=230)

In [45]:
data.groupby("month").head()

,index,date,duration,item,month,network,network_type
0,0,2014-10-15 06:58:00,34.429,data,2014-11,data,data
1,1,2014-10-15 06:58:00,13.000,call,2014-11,Vodafone,mobile
2,2,2014-10-15 14:46:00,23.000,call,2014-11,Meteor,mobile
3,3,2014-10-15 14:48:00,4.000,call,2014-11,Tesco,mobile
4,4,2014-10-15 17:27:00,4.000,call,2014-11,Tesco,mobile
228,228,2014-11-13 06:58:00,34.429,data,2014-12,data,data
231,231,2014-11-14 06:58:00,34.429,data,2014-12,data,data
232,232,2014-11-14 17:24:00,124.000,call,2014-12,voicemail,voicemail
233,233,2014-11-14 17:28:00,1.000,sms,2014-12,Vodafone,mobile
234,234,2014-11-15 06:58:00,34.429,data,2014-12,data,data
381,381,2014-12-13 06:58:00,34.429,data,2015-01,data,data
386,386,2014-12-14 06:58:00,34.429,data,2015-01,data,data
389,389,2014-12-15 06:58:00,34.429,data,2015-01,data,data
390,390,2014-12-15 19:56:00,1.000,sms,2015-01,Three,mobile
391,391,2014-12-15 19:58:00,1.000,sms,2015-01,Three,mobile
577,577,2015-01-13 06:58:00,34.429,data,2015-02,data,data
586,586,2015-01-14 06:58:00,34.429,data,2015-02,data,data
594,594,2015-01-15 06:58:00,34.429,data,2015-02,data,data
595,595,2015-01-15 10:36:00,28.000,call,2015-02,Three,mobile
596,596,2015-01-15 12:23:00,1.000,sms,2015-02,special,special
729,729,2015-02-12 20:15:00,69.000,call,2015-03,landline,landline
730,730,2015-02-12 20:51:00,86.000,call,2015-03,Tesco,mobile
731,731,2015-02-13 06:58:00,34.429,data,2015-03,data,data
732,732,2015-02-13 10:58:00,451.000,call,2015-03,Vodafone,mobile
733,733,2015-02-13 21:13:00,8.000,call,2015-03,Vodafone,mobile

In [46]:
data.groupby("month").first()

         index                date  duration  item   network network_type
month
2014-11      0 2014-10-15 06:58:00    34.429  data      data         data
2014-12    228 2014-11-13 06:58:00    34.429  data      data         data
2015-01    381 2014-12-13 06:58:00    34.429  data      data         data
2015-02    577 2015-01-13 06:58:00    34.429  data      data         data
2015-03    729 2015-02-12 20:15:00    69.000  call  landline     landline

In [49]:
data.groupby("month")["duration"].sum()

month
2014-11    26639.441
2014-12    14641.870
2015-01    18223.299
2015-02    15522.299
2015-03    22750.441
Name: duration, dtype: float64

In [50]:
data["month"].value_counts()

2014-11    230
2015-01    205
2014-12    157
2015-02    137
2015-03    101
Name: month, dtype: int64

In [55]:
data.groupby("month")["date"].count()

month
2014-11    230
2014-12    157
2015-01    205
2015-02    137
2015-03    101
Name: date, dtype: int64

Q) item 값이 call인 데이터에서 통신사별로(network) duration의 값의 총 합을 보고자 함.

In [76]:
data[data["item"]=="call"].groupby("network")["duration"].sum()

network
Meteor        7200.0
Tesco        13828.0
Three        36464.0
Vodafone     14621.0
landline     18433.0
voicemail     1775.0
Name: duration, dtype: float64

In [73]:
data.groupby(["month","item"])["date"].count()

month    item
2014-11  call    107
         data     29
         sms      94
2014-12  call     79
         data     30
         sms      48
2015-01  call     88
         data     31
         sms      86
2015-02  call     67
         data     31
         sms      39
2015-03  call     47
         data     29
         sms      25
Name: date, dtype: int64

In [80]:
#기준: month-item
#보고자 하는 값 : duration, network_type, date
#duration->합, network_type->건수, date-> 제일 처음 값
data.groupby(["month","item"]).agg({"duration":"sum","network_type":"count","date":"first"})#->메소드를 모두 문자열로 지정해야함

               duration  network_type                date
month   item
2014-11 call  25547.000           107 2014-10-15 06:58:00
        data    998.441            29 2014-10-15 06:58:00
        sms      94.000            94 2014-10-16 22:18:00
2014-12 call  13561.000            79 2014-11-14 17:24:00
        data   1032.870            30 2014-11-13 06:58:00
        sms      48.000            48 2014-11-14 17:28:00
2015-01 call  17070.000            88 2014-12-15 20:03:00
        data   1067.299            31 2014-12-13 06:58:00
        sms      86.000            86 2014-12-15 19:56:00
2015-02 call  14416.000            67 2015-01-15 10:36:00
        data   1067.299            31 2015-01-13 06:58:00
        sms      39.000            39 2015-01-15 12:23:00
2015-03 call  21727.000            47 2015-02-12 20:15:00
        data    998.441            29 2015-02-13 06:58:00
        sms      25.000            25 2015-02-19 18:46:00

In [82]:
#위의 것과 같이 pivot 테이블로 만들기
pd.pivot_table(data, index=["month","item"],
               aggfunc={"duration":"sum","network_type":"count","date":"first"})#->메소드를 모두 문자열로 지정해야함

                            date   duration  network_type
month   item
2014-11 call 2014-10-15 06:58:00  25547.000           107
        data 2014-10-15 06:58:00    998.441            29
        sms  2014-10-16 22:18:00     94.000            94
2014-12 call 2014-11-14 17:24:00  13561.000            79
        data 2014-11-13 06:58:00   1032.870            30
        sms  2014-11-14 17:28:00     48.000            48
2015-01 call 2014-12-15 20:03:00  17070.000            88
        data 2014-12-13 06:58:00   1067.299            31
        sms  2014-12-15 19:56:00     86.000            86
2015-02 call 2015-01-15 10:36:00  14416.000            67
        data 2015-01-13 06:58:00   1067.299            31
        sms  2015-01-15 12:23:00     39.000            39
2015-03 call 2015-02-12 20:15:00  21727.000            47
        data 2015-02-13 06:58:00    998.441            29
        sms  2015-02-19 18:46:00     25.000            25

In [44]:
for name, group in data.groupby("month"):
    print(name)
    print(group)
    print("------------")

2014-11
     index                date  duration  item    month   network network_type
0        0 2014-10-15 06:58:00    34.429  data  2014-11      data         data
1        1 2014-10-15 06:58:00    13.000  call  2014-11  Vodafone       mobile
2        2 2014-10-15 14:46:00    23.000  call  2014-11    Meteor       mobile
3        3 2014-10-15 14:48:00     4.000  call  2014-11     Tesco       mobile
4        4 2014-10-15 17:27:00     4.000  call  2014-11     Tesco       mobile
..     ...                 ...       ...   ...      ...       ...          ...
225    225 2014-11-12 19:18:00     1.000   sms  2014-11     Three       mobile
226    226 2014-11-12 19:18:00     1.000   sms  2014-11     Three       mobile
227    227 2014-11-12 19:20:00     1.000   sms  2014-11  Vodafone       mobile
229    229 2014-11-13 22:30:00     1.000   sms  2014-11     Three       mobile
230    230 2014-11-13 22:31:00     1.000   sms  2014-11  Vodafone       mobile

[230 rows x 7 columns]
------------
2014-12
     index                date  duration  item    month    network  \
228    228 2014-11-13 06:58:00    34.429  data  2014-12       data
231    231 2014-11-14 06:58:00    34.429  data  2014-12       data
232    232 2014-11-14 17:24:00   124.000  call  2014-12  voicemail
233    233 2014-11-14 17:28:00     1.000   sms  2014-12   Vodafone
234    234 2014-11-15 06:58:00    34.429  data  2014-12       data
..     ...                 ...       ...   ...      ...        ...
383    383 2014-12-14 02:05:00    14.000  call  2014-12   landline
384    384 2014-12-14 02:07:00     8.000  call  2014-12   landline
385    385 2014-12-14 02:09:00    74.000  call  2014-12   landline
387    387 2014-12-14 15:28:00    59.000  call  2014-12  voicemail
388    388 2014-12-14 19:54:00    25.000  call  2014-12      Three

    network_type
228         data
231         data
232    voicemail
233       mobile
234         data
..           ...
383     landline
384     landline
385     landline
387    voicemail
388       mobile

[157 rows x 7 columns]
------------
2015-01
     index                date  duration  item    month   network network_type
381    381 2014-12-13 06:58:00    34.429  data  2015-01      data         data
386    386 2014-12-14 06:58:00    34.429  data  2015-01      data         data
389    389 2014-12-15 06:58:00    34.429  data  2015-01      data         data
390    390 2014-12-15 19:56:00     1.000   sms  2015-01     Three       mobile
391    391 2014-12-15 19:58:00     1.000   sms  2015-01     Three       mobile
..     ...                 ...       ...   ...      ...       ...          ...
589    589 2015-01-14 20:47:00    36.000  call  2015-01     Three       mobile
590    590 2015-01-14 23:34:00     1.000   sms  2015-01  Vodafone       mobile
591    591 2015-01-14 23:34:00     1.000   sms  2015-01  Vodafone       mobile
592    592 2015-01-14 23:35:00     1.000   sms  2015-01     Three       mobile
593    593 2015-01-14 23:36:00     1.000   sms  2015-01     Three       mobile

[205 rows x 7 columns]
------------
2015-02
     index                date  duration  item    month   network network_type
577    577 2015-01-13 06:58:00    34.429  data  2015-02      data         data
586    586 2015-01-14 06:58:00    34.429  data  2015-02      data         data
594    594 2015-01-15 06:58:00    34.429  data  2015-02      data         data
595    595 2015-01-15 10:36:00    28.000  call  2015-02     Three       mobile
596    596 2015-01-15 12:23:00     1.000   sms  2015-02   special      special
..     ...                 ...       ...   ...      ...       ...          ...
724    724 2015-02-10 00:24:00     1.000   sms  2015-02  Vodafone       mobile
725    725 2015-02-10 06:58:00    34.429  data  2015-02      data         data
726    726 2015-02-10 21:40:00     1.000   sms  2015-02  Vodafone       mobile
727    727 2015-02-11 06:58:00    34.429  data  2015-02      data         data
728    728 2015-02-12 06:58:00    34.429  data  2015-02      data         data

[137 rows x 7 columns]
------------
2015-03
     index                date  duration  item    month   network network_type
729    729 2015-02-12 20:15:00    69.000  call  2015-03  landline     landline
730    730 2015-02-12 20:51:00    86.000  call  2015-03     Tesco       mobile
731    731 2015-02-13 06:58:00    34.429  data  2015-03      data         data
732    732 2015-02-13 10:58:00   451.000  call  2015-03  Vodafone       mobile
733    733 2015-02-13 21:13:00     8.000  call  2015-03  Vodafone       mobile
..     ...                 ...       ...   ...      ...       ...          ...
825    825 2015-03-13 00:38:00     1.000   sms  2015-03     world        world
826    826 2015-03-13 00:39:00     1.000   sms  2015-03  Vodafone       mobile
827    827 2015-03-13 06:58:00    34.429  data  2015-03      data         data
828    828 2015-03-14 00:13:00     1.000   sms  2015-03     world        world
829    829 2015-03-14 00:16:00     1.000   sms  2015-03     world        world

[101 rows x 7 columns]
------------